## **常用框架工具-Pandas作业5**

<font color=red>本课程未完全覆盖 Pandas 中的全部操作，欢迎你将更全面的 Pandas 学习笔记分享到[ AI Gallery Notebook](https://marketplace.huaweicloud.com/markets/aihub/notebook/list/) 版块获得[成长值](https://marketplace.huaweicloud.com/markets/aihub/article/detail/?content_id=9b8d7e7a-a150-449e-ac17-2dcf76d8b492)，分享方法请查看[此文档](https://marketplace.huaweicloud.com/markets/aihub/article/detail/?content_id=8afec58a-b797-4bf9-acca-76ed512a3acb)。</font>

### **题目描述**
### 创建一个DataFrame，并对其所有列名重新命名。

参考数据如下：

        data = {"col1":['Python', 'C', 'Java', 'R', 'SQL', 'PHP', 'Python', 'Java', 'C', 'Python'],

               "col2":[6, 2, 6, 4, 2, 5, 8, 10, 3, 4], 

               "col3":[4, 2, 6, 2, 1, 2, 2, 3, 3, 6]}
        
        可更改列名为['grammer', 'score', 'cycle']

#### 1. 导入数据

In [2]:
import pandas as pd

data = {"col1":['Python', 'C', 'Java', 'R', 'SQL', 'PHP', 'Python', 'Java', 'C', 'Python'],
       "col2":[6, 2, 6, 4, 2, 5, 8, 10, 3, 4], 
       "col3":[4, 2, 6, 2, 1, 2, 2, 3, 3, 6]}

#### 2. 转换为DataFrame

In [3]:
df = pd.DataFrame(data)
df.head()

     col1  col2  col3
0  Python     6     4
1       C     2     2
2    Java     6     6
3       R     4     2
4     SQL     2     1

#### 3. 更改列名为['grammer', 'score', 'cycle']

In [4]:
df.columns = ['grammer', 'score', 'cycle']
df

  grammer  score  cycle
0  Python      6      4
1       C      2      2
2    Java      6      6
3       R      4      2
4     SQL      2      1
5     PHP      5      2
6  Python      8      2
7    Java     10      3
8       C      3      3
9  Python      4      6